app/controllers/artists_controller.rb

  def index
    @artists = Artist.all.order :name
---
SELECT "artists".* FROM "artists"